Autodesk.Revit.UI.Events.DisplayingOptionsDialogEventArgs.PagesCount
The count of pages in the options dialog (include the default pages added by Revit).
Since: 2013

Autodesk.Revit.UI.Events.DisplayingOptionsDialogEventArgs.AddTab(System.String,Autodesk.Revit.UI.TabbedDialogExtension)
Add tab to option dialog with tab name and handler information.
Remarks:
There is a limit to the number of options page permitted in the dialog.
newTabName:  The new tab page name.
tabbedDialogExtension:  The handlers information for the new tab page.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when the limit
of pages allowed in the Options dialog will be exceeded (99).
Since: 2013

Autodesk.Revit.UI.Events.DisplayingOptionsDialogEventArgs
The event arguments used by DisplayingOptionDialog event.